import { Prefecture } from '../types';

export const prefectureData: Prefecture[] = [
  {
    name: "北海道",
    teams: ["北海道コンサドーレ札幌"],
  },
  {
    name: "青森県",
    teams: ["ヴァンラーレ八戸"],
  },
  {
    name: "宮城県",
    teams: ["ベガルタ仙台"],
  },
  {
    name: "山形県",
    teams: ["モンテディオ山形"],
  },
  {
    name: "福島県",
    teams: ["いわきFC", "福島ユナイテッドFC"],
  },
  {
    name: "茨城県",
    teams: ["鹿島アントラーズ", "水戸ホーリーホック"],
  },
  {
    name: "栃木県",
    teams: ["栃木SC"],
  },
  {
    name: "群馬県",
    teams: ["ザスパクサツ群馬"],
  },
  {
    name: "埼玉県",
    teams: ["浦和レッドダイヤモンズ", "大宮アルディージャ"],
  },
  {
    name: "千葉県",
    teams: ["ジェフユナイテッド千葉", "柏レイソル"],
  },
  {
    name: "東京都",
    teams: ["FC東京", "東京ヴェルディ", "FC町田ゼルビア"],
  },
  {
    name: "神奈川県",
    teams: [
      "横浜F・マリノス", 
      "川崎フロンターレ", 
      "湘南ベルマーレ", 
      "横浜FC", 
      "Y.S.C.C.横浜", 
      "SC相模原"
    ],
  },
  {
    name: "新潟県",
    teams: ["アルビレックス新潟"],
  },
  {
    name: "富山県",
    teams: ["カターレ富山"],
  },
  {
    name: "石川県",
    teams: ["ツエーゲン金沢"],
  },
  {
    name: "長野県",
    teams: ["松本山雅FC", "AC長野パルセイロ"],
  },
  {
    name: "岐阜県",
    teams: ["FC岐阜"],
  },
  {
    name: "静岡県",
    teams: ["清水エスパルス", "ジュビロ磐田", "藤枝MYFC", "アスルクラロ沼津"],
  },
  {
    name: "愛知県",
    teams: ["名古屋グランパス"],
  },
  {
    name: "京都府",
    teams: ["京都サンガF.C."],
  },
  {
    name: "大阪府",
    teams: ["ガンバ大阪", "セレッソ大阪", "FC大阪"],
  },
  {
    name: "兵庫県",
    teams: ["ヴィッセル神戸"],
  },
  {
    name: "奈良県",
    teams: ["奈良クラブ"],
  },
  {
    name: "岡山県",
    teams: ["ファジアーノ岡山"],
  },
  {
    name: "広島県",
    teams: ["サンフレッチェ広島"],
  },
  {
    name: "山口県",
    teams: ["レノファ山口FC"],
  },
  {
    name: "徳島県",
    teams: ["徳島ヴォルティス"],
  },
  {
    name: "香川県",
    teams: ["カマタマーレ讃岐"],
  },
  {
    name: "愛媛県",
    teams: ["愛媛FC", "FC今治"],
  },
  {
    name: "福岡県",
    teams: ["アビスパ福岡", "ギラヴァンツ北九州"],
  },
  {
    name: "佐賀県",
    teams: ["サガン鳥栖"],
  },
  {
    name: "長崎県",
    teams: ["V・ファーレン長崎"],
  },
  {
    name: "熊本県",
    teams: ["ロアッソ熊本"],
  },
  {
    name: "大分県",
    teams: ["大分トリニータ"],
  },
  {
    name: "鹿児島県",
    teams: ["鹿児島ユナイテッドFC"],
  },
  {
    name: "岩手県",
    teams: ["いわてグルージャ盛岡"],
  },
  {
    name: "宮崎県",
    teams: ["テゲバジャーロ宮崎"],
  },
  {
    name: "鳥取県",
    teams: ["ガイナーレ鳥取"],
  },
  {
    name: "沖縄県",
    teams: ["FC琉球"],
  },
  {
    name: "秋田県",
    teams: ["ブラウブリッツ秋田"],
  },
  {
    name: "山梨県",
    teams: ["ヴァンフォーレ甲府"],
  },
];
